Repository: RockxyApp/Rockxy
Catalog: Rockxy/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Diff
zh_hans: 差异

source: Difference between captured total durations.
zh_hans: 捕获的总时长之差。

source: Dir
zh_hans: 目录

source: Direct
zh_hans: 直连

source: Direction:
zh_hans: 方向：

source: Directory available
zh_hans: 目录可用

source: Disable
zh_hans: 停用

source: Disable %@
zh_hans: 停用 %@

source: Disable All
zh_hans: 全部停用

source: Disable caching (No-Cache headers)
zh_hans: 停用缓存（No-Cache 标头）

source: Disable macOS System Proxy
zh_hans: 停用 macOS 系统代理

source: Disable Rule
zh_hans: 停用规则

source: Disable Script
zh_hans: 停用脚本

source: Disable SSL Proxying
zh_hans: 停用 SSL 代理

source: Disable this rule
zh_hans: 停用此规则

source: Disabled
zh_hans: 已停用

source: Disabled SSL Proxying for %@. Requests to it will stay tunneled.
zh_hans: 已为 %@ 停用 SSL 代理。对它的请求将保持隧道传输。

source: Disabled SSL Proxying for domains from %@. Requests from it will stay tunneled.
zh_hans: 已为 %@ 的域名停用 SSL 代理。来自该 App 的请求将继续通过隧道传输。

source: Disabled where supported
zh_hans: 在支持的情况下停用

source: Discard Changes
zh_hans: 放弃更改

source: Discard edits and continue with the original message
zh_hans: 放弃编辑并继续使用原始消息

source: Disconnect
zh_hans: 断开连接

source: Discoverable and searchable on GitHub by anyone.
zh_hans: 任何人都能在 GitHub 上发现并搜索到。

source: Discovered
zh_hans: 已发现

source: Discovered names are cached suggestions from captured traffic.
zh_hans: 发现的名称是根据捕获流量缓存的建议。

source: Discovery
zh_hans: 发现

source: Disk Space
zh_hans: 磁盘空间

source: Display as Key-Value
zh_hans: 显示为键值对

source: Divider
zh_hans: 分隔线

source: DNS Lookup
zh_hans: DNS 查询

source: Do not open, install, or trust this certificate until Rockxy can show a fingerprint for verification.
zh_hans: 在 Rockxy 能够显示指纹供验证之前，请勿打开、安装或信任此证书。

source: Do you see an authentication problem here?
zh_hans: 你在此处看到了认证问题吗？

source: Docker ships a manual host.docker.internal + mounted-CA command.
zh_hans: Docker 提供手动 host.docker.internal + 挂载 CA 命令。

source: Does Not Contain
zh_hans: 不包含

source: Domain
zh_hans: 域名

source: Domain and subdomains
zh_hans: 域名和子域名

# Domain: %@%@
source: Domain: %1$@%2$@
zh_hans: 域名：%1$@%2$@

source: Domains
zh_hans: 域名

source: Don’t ask again
zh_hans: 不再询问

source: Done
zh_hans: 完成

source: Down: ⌘↓
zh_hans: 下移：⌘↓

source: Download
zh_hans: 下载

source: Download & Use
zh_hans: 下载并使用

source: Download Another Ollama Model
zh_hans: 下载其他 Ollama 模型

source: Download cancelled.
zh_hans: 下载已取消。

source: Download Details
zh_hans: 下载详细信息

source: Downloaded
zh_hans: 已下载

source: Downloading %@…
zh_hans: 正在下载 %@…

source: Downloading official runtime: %@
zh_hans: 正在下载官方运行时：%@

# Downloading official runtime: %@ of %@
source: Downloading official runtime: %1$@ of %2$@
zh_hans: 正在下载官方运行时：%1$@ / %2$@

source: Downloading Rockxy %@…
zh_hans: 正在下载 Rockxy %@…

source: Downloading the signed update.
zh_hans: 正在下载已签名的更新。

source: Downloading update…
zh_hans: 正在下载更新…

source: Drag column headers in the traffic table to reorder or resize.
zh_hans: 在流量表格中拖动列标头，以重新排序或调整大小。

source: Drag rows to reorder
zh_hans: 拖移行以重新排序

source: Drop Connection
zh_hans: 断开连接

source: Dry-run or gas/compute estimation
zh_hans: 试运行或 Gas/计算估算

source: Duplicate
zh_hans: 复制

source: Duration
zh_hans: 时长

source: e.g. 1
zh_hans: 例如 1

source: e.g. application/json
zh_hans: 例如 application/json

source: e.g. Content-Type
zh_hans: 例如 Content-Type

source: e.g. enabled
zh_hans: 例如 enabled

source: e.g. page
zh_hans: 例如 page

source: e.g. X-Debug-Mode
zh_hans: 例如 X-Debug-Mode

source: Edit
zh_hans: 编辑

source: Edit Allow Rule
zh_hans: 编辑允许规则

source: Edit and Repeat…
zh_hans: 编辑并重发…

source: Edit Block Rule
zh_hans: 编辑阻止规则

source: Edit Breakpoint Rule
zh_hans: 编辑断点规则

source: Edit Focus Set
zh_hans: 编辑焦点集

source: Edit Header Rule
zh_hans: 编辑标头规则

source: Edit HTTPS Rule
zh_hans: 编辑 HTTPS 规则

source: Edit Map Local Rule
zh_hans: 编辑 Map Local 规则

source: Edit Map Remote Rule
zh_hans: 编辑 Map Remote 规则

source: Edit Mapping Definition
zh_hans: 编辑映射定义

source: Edit Network Conditions Rule
zh_hans: 编辑网络条件规则

source: Edit Rule
zh_hans: 编辑规则

source: Edit Script
zh_hans: 编辑脚本

source: Edit status and headers here. Captured binary body bytes stay preserved and text after the blank line is ignored.
zh_hans: 在此编辑状态和标头。捕获的二进制正文数据会保留，空行后的文本将被忽略。

source: Edit status and headers here. Response bodies come from the matched file in this directory; text after the blank line is ignored.
zh_hans: 在此编辑状态和标头。响应正文来自此目录中匹配的文件；空行之后的文本将被忽略。

source: Edit status and headers here. The body comes from the user-owned file and text after the blank line is ignored.
zh_hans: 在此编辑状态和标头。正文来自用户所有的文件，空行后的文本将被忽略。

source: Edit Text
zh_hans: 编辑文本

source: Edit the current Wi-Fi network and enter a manual HTTP proxy pointing at the Mac's LAN IP and Rockxy's port.
zh_hans: 编辑当前 Wi-Fi 网络，输入指向 Mac 局域网 IP 和 Rockxy 端口的手动 HTTP 代理。

source: Edit the exact message to apply while traffic is paused.
zh_hans: 编辑流量暂停时要应用的确切消息。

source: Edit the status line, response headers, and body. Rockxy always recalculates Content-Length.
zh_hans: 编辑状态行、响应标头和正文。Rockxy 始终会重新计算 Content-Length。

source: Edit…
zh_hans: 编辑…

source: Electron configuration
zh_hans: Electron 配置

source: ElectronJS ships manual CLI-flag + session.setProxy snippets.
zh_hans: ElectronJS 提供手动 CLI 标志 + session.setProxy 代码片段。

source: Empty Body
zh_hans: 空正文

source: Empty Console
zh_hans: 清空控制台

source: Empty Request
zh_hans: 空请求

source: Empty signature
zh_hans: 签名为空

source: Enable
zh_hans: 启用

source: Enable %@
zh_hans: 启用 %@

source: Enable Allow List
zh_hans: 启用允许列表

source: Enable Block List
zh_hans: 启用阻止列表

source: Enable Breakpoint Tool
zh_hans: 启用断点工具

source: Enable decryption below, then repeat the request.
zh_hans: 在下方启用解密，然后重新发送该请求。

source: Enable External Proxy
zh_hans: 启用外部代理

source: Enable failed: %@
zh_hans: 启用失败：%@

source: Enable for Host
zh_hans: 为主机启用

source: Enable HTTPS Decryption
zh_hans: 启用 HTTPS 解密

source: Enable Insomnia's proxy toggle, paste Rockxy's host and port, and trust the exported PEM.
zh_hans: 启用 Insomnia 的代理开关，粘贴 Rockxy 的主机和端口，并信任导出的 PEM。

source: Enable Insomnia's proxy toggle, paste the values, and trust the exported PEM.
zh_hans: 启用 Insomnia 的代理开关，粘贴这些值，并信任导出的 PEM。

source: Enable log capture to see application logs
zh_hans: 启用日志捕获以查看应用程序日志

source: Enable macOS System Proxy
zh_hans: 启用 macOS 系统代理

source: Enable Map Local
zh_hans: 启用 Map Local

source: Enable Map Remote
zh_hans: 启用 Map Remote

source: Enable MCP Server
zh_hans: 启用 MCP 服务器

source: Enable model access
zh_hans: 启用模型访问

source: Enable model access in AI Assistant Settings before sending data.
zh_hans: 发送数据前，请先在 AI 助手设置中启用模型访问。

source: Enable Modify Headers
zh_hans: 启用修改标头

source: Enable Network Conditions
zh_hans: 启用网络条件

source: Enable Rule
zh_hans: 启用规则

source: Enable Script
zh_hans: 启用脚本

source: Enable Scripting
zh_hans: 启用脚本

source: Enable SSL Proxying
zh_hans: 启用 SSL 代理

source: Enable System Proxy
zh_hans: 启用系统代理

source: Enable this rule
zh_hans: 启用此规则

source: Enabled
zh_hans: 已启用

source: Enabled scripts are not active. Review the Status column before testing traffic.
zh_hans: 已启用的脚本并未生效。测试流量前请查看状态列。

source: Enabled SSL Proxying for %@. Make the request again to inspect it.
zh_hans: 已为 %@ 启用 SSL 代理。请再次发送请求以检查它。

source: Enabled SSL Proxying for domains from %@. Make the request again to inspect them.
zh_hans: 已为 %@ 的域名启用 SSL 代理。请再次发送请求以检查它们。

source: Encrypted HTTPS
zh_hans: 加密的 HTTPS

source: Encrypted HTTPS connection
zh_hans: 加密的 HTTPS 连接

source: Ended
zh_hans: 已结束

source: Endpoint
zh_hans: 端点

source: Ends With
zh_hans: 结尾为

source: Enter a complete HTTP or HTTPS URL.
zh_hans: 请输入完整的 HTTP 或 HTTPS URL。

source: Enter a complete wildcard host such as *.example.com.
zh_hans: 输入完整的通配符主机，例如 *.example.com。

source: Enter a full HTTP or HTTPS URL without credentials or a fragment.
zh_hans: 请输入不含凭据和片段的完整 HTTP 或 HTTPS URL。

source: Enter a header name.
zh_hans: 请输入标头名称。

source: Enter a host only. Put the port in the Port field.
zh_hans: 仅输入主机。请在“端口”字段中填写端口。

source: Enter a host or choose All proxied traffic.
zh_hans: 输入主机或选择所有代理流量。

source: Enter a host pattern for this certificate before importing.
zh_hans: 导入前，请为此证书输入主机模式。

source: Enter a host pattern.
zh_hans: 输入主机模式。

source: Enter a host with an optional port, or paste an HTTP or HTTPS URL. URL paths and queries are ignored. Wildcards and raw regular expressions are not added from this editor.
zh_hans: 输入主机和可选端口，或粘贴 HTTP 或 HTTPS URL。URL 路径和查询将被忽略。此编辑器不会添加通配符和原始正则表达式。

source: Enter a host: * for all, an exact host or IPv4, or *.domain.com for subdomains.
zh_hans: 请输入主机：使用 * 匹配全部，输入精确主机或 IPv4，或使用 *.domain.com 匹配子域名。

source: Enter a hostname or IP address without a URL scheme.
zh_hans: 输入不含 URL 方案的主机名或 IP 地址。

source: Enter a name without control characters.
zh_hans: 请输入不含控制字符的名称。

source: Enter a note for this request:
zh_hans: 请输入此请求的备注：

source: Enter a port between 1 and 65535.
zh_hans: 输入 1 到 65535 之间的端口。

source: Enter a port between 1 and 65535. Applied changes take effect after the proxy restarts.
zh_hans: 请输入 1 到 65535 之间的端口。应用的更改会在代理重新启动后生效。

source: Enter a Project name.
zh_hans: 请输入项目名称。

source: Enter a rule name.
zh_hans: 请输入规则名称。

source: Enter a source to mute.
zh_hans: 输入要静音的来源。

source: Enter a Traffic Tab name.
zh_hans: 输入流量标签页名称。

source: Enter a URL pattern.
zh_hans: 请输入 URL 模式。

source: Enter a URL to fill the destination fields.
zh_hans: 输入 URL 以填充目标字段。

source: Enter a valid hostname, IPv4 address, or IPv6 address with an optional port from 1 to 65535.
zh_hans: 请输入有效的主机名、IPv4 地址或 IPv6 地址，并可选择指定 1 到 65535 之间的端口。

source: Enter a valid hostname, IPv4 address, or IPv6 address.
zh_hans: 请输入有效的主机名、IPv4 地址或 IPv6 地址。

source: Enter a valid HTTP or HTTPS base URL
zh_hans: 输入有效的 HTTP 或 HTTPS 基础 URL

source: Enter a valid regular expression.
zh_hans: 请输入有效的正则表达式。

source: Enter a valid Traffic Tab name.
zh_hans: 请输入有效的流量标签页名称。

source: Enter an exact model tag from the Ollama model library.
zh_hans: 请输入 Ollama 模型库中的确切模型标签。

source: Enter an HTTP or HTTPS PAC file URL.
zh_hans: 输入 HTTP 或 HTTPS PAC 文件 URL。

source: Enter one host pattern per line. Use * for all hosts or *.domain.com for subdomains.
zh_hans: 每行输入一个主机模式。使用 * 匹配所有主机，或使用 *.domain.com 匹配子域名。

source: Enter only a host pattern, without a scheme, path, query, or user information.
zh_hans: 只输入主机模式，不要包含方案、路径、查询或用户信息。

source: Enter the host or wildcard pattern this server certificate should match.
zh_hans: 输入此服务器证书应匹配的主机或通配符模式。

source: Enter the password again when changing the saved username.
zh_hans: 更改已保存的用户名时，请再次输入密码。

source: Enter the password for this P12 file. Leave it empty if the file has no password.
zh_hans: 输入此 P12 文件的密码。如果该文件没有密码，请留空。

source: Enter the upstream host or wildcard pattern that should receive this client identity.
zh_hans: 输入应接收此客户端身份的上游主机或通配符模式。

source: Enter the upstream proxy password.
zh_hans: 请输入上游代理密码。

source: Enter the upstream proxy username.
zh_hans: 输入上游代理用户名。

source: Enter this code on GitHub:
zh_hans: 在 GitHub 上输入此代码：

source: Env
zh_hans: 环境

source: Environments
zh_hans: 环境

source: Error
zh_hans: 错误

source: Error Details
zh_hans: 错误详情

source: Errors
zh_hans: 错误

source: Event
zh_hans: 事件

source: Event Time
zh_hans: 事件时间

source: Event, receipt, or transaction lookup
zh_hans: 事件、回执或交易查询

source: Events
zh_hans: 事件

source: Evidence
zh_hans: 证据

source: Exact model ID
zh_hans: 确切的模型 ID

source: Exact Reviewed Content
zh_hans: 确切的审查内容

source: example.com or *.internal
zh_hans: example.com 或 *.internal

source: Exclude
zh_hans: 排除

source: Exclude Value
zh_hans: 排除值

source: Existing connections disconnect immediately, and every Babylon client must be updated with the new token before it can reconnect.
zh_hans: 现有连接会立即断开，每个 Babylon 客户端都必须更新为新令牌后才能重新连接。

source: Expand %@
zh_hans: 展开 %@

source: Expand Rules
zh_hans: 展开规则

source: Expected : in slice.
zh_hans: 切片中应有 :。

source: Expected ( after ?.
zh_hans: 在 ?. 后应有 (。

source: Expected (.
zh_hans: 应为 (.

source: Expected ) after filter.
zh_hans: 筛选器后应有 )。

source: Expected ).
zh_hans: 应为 )。

source: Expected ].
zh_hans: 应为 ]。

source: Expected &&.
zh_hans: 应为 &&。

source: Expected ||.
zh_hans: 应为 ||。

source: Expected expression.
zh_hans: 应为表达式。

source: Expected header.payload.signature.
zh_hans: 应为 header.payload.signature。

source: Expected identifier.
zh_hans: 应为标识符。

source: Expected path expression.
zh_hans: 应为路径表达式。

source: Expected string.
zh_hans: 应为字符串。

source: Expires
zh_hans: 到期

source: Explain the reviewed request.
zh_hans: 解释已审查的请求。

source: Explain This Failure
zh_hans: 解释此失败

source: Explain This Request
zh_hans: 解释此请求

source: Explain what the request does, its captured outcome, and anything worth checking.
zh_hans: 说明请求的作用、捕获的结果，以及任何值得检查的内容。

source: Explain what this request does and whether anything looks unusual.
zh_hans: 说明此请求的用途，以及是否有任何异常。

source: Export
zh_hans: 导出

source: Export as HAR
zh_hans: 导出为 HAR

source: Export as HAR…
zh_hans: 导出为 HAR…

source: Export as OpenAPI
zh_hans: 导出为 OpenAPI

source: Export as OpenAPI HTML
zh_hans: 导出为 OpenAPI HTML

source: Export as OpenAPI HTML…
zh_hans: 导出为 OpenAPI HTML…

source: Export as OpenAPI YAML
zh_hans: 导出为 OpenAPI YAML

source: Export as OpenAPI YAML…
zh_hans: 导出为 OpenAPI YAML…

source: Export Certificate
zh_hans: 导出证书

source: Export Certificate…
zh_hans: 导出证书…

source: Export Diff
zh_hans: 导出差异

source: Export Failed
zh_hans: 导出失败

source: Export HAR…
zh_hans: 导出 HAR…

source: Export OpenAPI HTML…
zh_hans: 导出 OpenAPI HTML…

source: Export OpenAPI YAML…
zh_hans: 导出 OpenAPI YAML…

source: Export PEM
zh_hans: 导出 PEM

source: Export Private Certificate Material?
zh_hans: 导出私有证书材料？

source: Export Project Configuration…
zh_hans: 导出项目配置…

source: Export Request Body…
zh_hans: 导出请求正文…

source: Export required
zh_hans: 需要导出

source: Export Response Body…
zh_hans: 导出响应正文…

source: Export Rules
zh_hans: 导出规则

source: Export Selected as OpenAPI
zh_hans: 将所选项导出为 OpenAPI

source: Export Selected Project Configuration
zh_hans: 导出所选项目配置

source: Export Selected…
zh_hans: 导出所选项…

source: Export Selection
zh_hans: 导出所选内容

source: Export Settings…
zh_hans: 导出设置…

source: Export the comparison as a text file
zh_hans: 将比较结果导出为文本文件

source: Export the Rockxy root certificate to add certificate environment hints.
zh_hans: 导出 Rockxy 根证书以添加证书环境提示。

source: Export Transactions
zh_hans: 导出交易

source: Export…
zh_hans: 导出…

# Exported %@ from %lld requests
source: Exported %1$@ from %2$lld requests
zh_hans: 已从 %2$lld 个请求导出 %1$@

# Exported %@ from %lld requests; skipped %lld ineligible requests
source: Exported %1$@ from %2$lld requests; skipped %3$lld ineligible requests
zh_hans: 已从 %2$lld 个请求导出 %1$@；跳过 %3$lld 个不符合条件的请求

source: Exported Project configuration
zh_hans: 已导出项目配置

source: Exporter
zh_hans: 导出器

source: Exports & Sharing
zh_hans: 导出与共享

source: Exports Contain Full Traffic Data
zh_hans: 导出内容包含完整流量数据

source: Exports tabs, filters, and layout only. Captured traffic is excluded. Filter text may be sensitive; review it before sharing.
zh_hans: 仅导出标签页、筛选条件和布局。不包含捕获的流量。筛选文本可能包含敏感信息；共享前请仔细检查。

source: External file available
zh_hans: 外部文件可用

source: External file is currently unavailable
zh_hans: 外部文件当前不可用

source: External Proxy
zh_hans: 外部代理

source: External Proxy is off
zh_hans: 外部代理已关闭

source: External Proxy is on
zh_hans: 外部代理已开启

source: External Proxy Settings
zh_hans: 外部代理设置

source: External Proxy Settings route Rockxy's outbound traffic through an upstream HTTP/HTTPS proxy, or a PAC URL.
zh_hans: 外部代理设置会通过上游 HTTP/HTTPS 代理或 PAC URL 路由 Rockxy 的出站流量。

source: External Proxy Settings…
zh_hans: 外部代理设置…

source: Failed
zh_hans: 失败

source: Failed to build the certificate sharing URL.
zh_hans: 无法生成证书共享 URL。

source: Failed to generate a secure sharing token.
zh_hans: 无法生成安全的共享令牌。

source: Failed to generate certificate: %@
zh_hans: 生成证书失败：%@

source: Failed to install certificate — %@
zh_hans: 证书安装失败 — %@

source: Failed to reset certificates: %@
zh_hans: 重置证书失败：%@

source: Family
zh_hans: 系列

source: Favorites
zh_hans: 个人收藏

source: Field
zh_hans: 字段

source: Field numbers are inferred heuristically; saved schemas are not applied in this build.
zh_hans: 字段编号是通过启发式推断的；此版本不会应用已保存的架构。

source: File
zh_hans: 文件

source: File Actions
zh_hans: 文件操作

# File is too large (%@ MB). Maximum supported size is %@ MB.
source: File is too large (%1$@ MB). Maximum supported size is %2$@ MB.
zh_hans: 文件过大（%1$@ MB）。支持的最大大小为 %2$@ MB。

source: File is too large to import (max 1 MB).
zh_hans: 文件过大，无法导入（最大 1 MB）。

source: File path
zh_hans: 文件路径

source: File-backed cURL bodies are not imported automatically. Load the file from the Body tab instead.
zh_hans: 不会自动导入由文件提供正文的 cURL 命令。请改为从“正文”标签页加载文件。

source: Fill fields
zh_hans: 填写字段

source: Fill from full URL
zh_hans: 从完整 URL 填充

source: Filter
zh_hans: 筛选

source: Filter by Value
zh_hans: 按值筛选

source: Filter console levels
zh_hans: 筛选控制台级别

source: Filter Domain or App
zh_hans: 过滤域名或 App

source: Filter muted sources
zh_hans: 筛选已静音的来源

source: Filter rules...
zh_hans: 筛选规则...

source: Filter sidebar
zh_hans: 过滤器边栏

source: Filter sidebar items
zh_hans: 筛选边栏项目

source: Filter Tools and verify partial arguments, final tool call state, and stream completion.
zh_hans: 筛选工具并验证部分参数、最终工具调用状态和流完成情况。

source: Find in Capture
zh_hans: 在捕获中查找

source: Find the closest successful request and compare captured evidence.
zh_hans: 查找最接近的成功请求并比较捕获的证据。

source: Find…
zh_hans: 查找…

source: Findings
zh_hans: 发现

source: Fingerprint
zh_hans: 指纹

source: Fingerprint unavailable — do not install
zh_hans: 指纹不可用 — 请勿安装

source: Fingerprint:
zh_hans: 指纹：

source: Finish
zh_hans: 完成

source: Finish %@
zh_hans: 完成 %@

source: Finished
zh_hans: 已完成

source: Finishing installation and relaunch preparation.
zh_hans: 正在完成安装并准备重新启动。

source: Firefox ships a manual proxy + certificate-import workflow.
zh_hans: Firefox 提供手动代理和证书导入工作流程。

source: First 6 shown
zh_hans: 显示前 6 个

source: Fix or discard the invalid Raw message before applying changes
zh_hans: 应用更改前，请修复或丢弃无效的 Raw 消息

source: Fix setup first
zh_hans: 请先修复设置

source: Flow
zh_hans: 流程

source: Flutter client
zh_hans: Flutter 客户端

source: Flutter ships manual client snippets plus the underlying iOS or Android setup guide.
zh_hans: Flutter 提供手动客户端代码片段，以及底层的 iOS 或 Android 设置指南。

source: Flutter still runs inside an iOS or Android target. Make sure that runtime can reach Rockxy and trust the root certificate before adding client code.
zh_hans: Flutter 仍运行在 iOS 或 Android 目标中。在添加客户端代码之前，请确保该运行时能够访问 Rockxy 并信任根证书。

source: Focus
zh_hans: 焦点

source: Focus and Noise settings will not change.
zh_hans: 焦点和噪声设置不会更改。

source: Focus and Noise were ignored once for this review.
zh_hans: 本次审查已忽略一次焦点和噪声设置。

source: Focus on URL
zh_hans: 聚焦 URL

source: Focus Search
zh_hans: 聚焦搜索

source: Focus Sets
zh_hans: 焦点集

source: Focus Sets are available in every Project. Saving applies this set to the current Traffic Tab.
zh_hans: 焦点集在每个项目中都可用。保存后会将此集合应用到当前流量标签页。

source: Focus URL Field
zh_hans: 聚焦 URL 字段

source: Focus: %@
zh_hans: 焦点：%@

source: Follow Live
zh_hans: 实时跟随

source: Follow Live is on for this tab. Scroll, select a row, or click again to stop. ⇧⌘L
zh_hans: 此标签页已开启实时跟随。滚动、选择一行或再次点击即可停止。⇧⌘L

source: Follow Live Traffic
zh_hans: 跟随实时流量

source: Follow subscribe id, notifications, unsubscribe, and any dropped WebSocket frames.
zh_hans: 跟踪订阅 ID、通知、取消订阅以及任何丢失的 WebSocket 帧。

source: Follow the proxy, certificate, snippet, device, or runtime guide.
zh_hans: 按照代理、证书、代码片段、设备或运行时指南操作。

source: Follow the returned transaction hash/signature into receipt or confirmation polling.
zh_hans: 根据返回的事务哈希/签名继续跟踪收据或确认轮询。

source: Follow Up
zh_hans: 跟进

source: Font Size:
zh_hans: 字体大小：

source: Footer
zh_hans: 页脚

source: For a real Apple TV or Apple Watch, use a reachable LAN address and set the manual HTTP proxy in the device settings where available.
zh_hans: 对于实体 Apple TV 或 Apple Watch，请使用可访问的局域网地址，并在设备设置中可用的位置设置手动 HTTP 代理。

source: For Java, HTTPS interception still needs the Rockxy root CA trusted in the exact JVM or IDE trust store, plus a Decrypt rule for the target application or host under HTTPS Decryption.
zh_hans: 对于 Java，HTTPS 拦截仍需要在对应的 JVM 或 IDE 信任库中信任 Rockxy 根 CA，并在 HTTPS 解密中为目标应用或主机添加解密规则。

source: For example: Checkout API
zh_hans: 例如：结账 API

source: Force Reset
zh_hans: 强制重置

# Force reset failed with exit code %d: %@
source: Force reset failed with exit code %1$d: %2$@
zh_hans: 强制重置失败，退出代码为 %1$d：%2$@

source: Force reset failed with exit code %d.
zh_hans: 强制重置失败，退出代码为 %d。

source: Force Reset Rockxy Helper…
zh_hans: 强制重置 Rockxy Helper…

source: Force reset the Rockxy Helper?
zh_hans: 强制重置 Rockxy Helper？

# Force reset was interrupted by signal %d: %@
source: Force reset was interrupted by signal %1$d: %2$@
zh_hans: 强制重置被信号 %1$d 中断：%2$@

source: Force reset was interrupted by signal %d.
zh_hans: 强制重置被信号 %d 中断。

source: Force Reset…
zh_hans: 强制重置…

source: Form URL-Encoded
zh_hans: 表单 URL 编码

source: Format
zh_hans: 格式

source: Format with
zh_hans: 格式化方式

source: Forwards the original request target while connecting to the remote destination.
zh_hans: 连接到远程目标时转发原始请求目标。

source: Found %lld models.
zh_hans: 找到 %lld 个模型。

source: Frame #%lld
zh_hans: 帧 #%lld

source: Frame capture stopped at the safety limit; the live connection remains active.
zh_hans: 帧捕获已在安全限制处停止；实时连接仍保持活动。

source: Frame Detail
zh_hans: 帧详情

source: Frameworks
zh_hans: 框架

source: From Android 7, apps only trust user CAs when their network-security-config opts in; you usually need a debug build that does so.
zh_hans: 从 Android 7 开始，App 仅在其 network-security-config 选择信任用户 CA 时才会信任它；通常需要启用该配置的调试构建。

source: From Charles Proxy…
zh_hans: 从 Charles Proxy 导入…

source: From HTTP Toolkit…
zh_hans: 从 HTTP Toolkit…

source: From Proxyman…
zh_hans: 从 Proxyman…

source: From Rockxy…
zh_hans: 从 Rockxy 导入…

source: Full destination URL
zh_hans: 完整目标 URL

source: Full HTTP response file detected — previewing file-owned status, headers, and body.
zh_hans: 检测到完整的 HTTP 响应文件 — 正在预览文件中定义的状态、标头和正文。

source: Full Proxy Bypass
zh_hans: 完全绕过代理

source: Full Proxy Bypass does not support a global * pattern.
zh_hans: 完全代理绕过不支持全局 * 模式。

source: Full Proxy Bypass…
zh_hans: 完全绕过代理…

source: Full restart beats hot reload after proxy changes
zh_hans: 代理更改后，完全重启比热重载更可靠

source: Full Value
zh_hans: 完整值

source: Gathering evidence for %@.
zh_hans: 正在为 %@ 收集证据。

source: General
zh_hans: 通用

source: Generate
zh_hans: 生成

source: Generate a pairing token so Babylon clients can authenticate.
zh_hans: 生成配对令牌，以便 Babylon 客户端进行身份验证。

source: Generate a root certificate to get started.
zh_hans: 生成根证书以开始。

source: Generate and export the Rockxy root certificate so the selected client can trust it.
zh_hans: 生成并导出 Rockxy 根证书，以便所选客户端信任它。

source: Generate Certificate
zh_hans: 生成证书

source: Generate New…
zh_hans: 生成新的…

source: Generate or export the root certificate before validating HTTPS traffic.
zh_hans: 验证 HTTPS 流量前，请先生成或导出根证书。

source: Generate Rockxy's root CA, then install and trust it in Keychain.
zh_hans: 生成 Rockxy 根 CA，然后在钥匙串中安装并信任它。

source: Generate Root CA
zh_hans: 生成根 CA

source: Generate Root Certificate
zh_hans: 生成根证书

source: Generate the certificate if needed, then export it as a PEM file.
zh_hans: 如有需要，请生成证书，然后将其导出为 PEM 文件。

source: Generate, Install & Trust
zh_hans: 生成、安装并信任

source: Generated
zh_hans: 已生成

source: Generated setup command
zh_hans: 已生成的设置命令

source: Generated setup snippet
zh_hans: 已生成设置片段

source: Generated, Not Installed
zh_hans: 已生成，未安装

source: Generated:
zh_hans: 生成时间：

source: Generating the Rockxy certificate…
zh_hans: 正在生成 Rockxy 证书…

source: Generating with %@
zh_hans: 正在使用 %@ 生成

source: Get Started
zh_hans: 开始使用

source: GET with Query
zh_hans: 带查询参数的 GET

source: Getting Started…
zh_hans: 入门指南…

source: Gist Permission:
zh_hans: Gist 权限：

source: GitHub authorization is still pending.
zh_hans: GitHub 授权仍在等待处理。

source: GitHub authorization was denied.
zh_hans: GitHub 授权被拒绝。
